Repository: AkiroMusic/Akiroute
Catalog: Akiroute/Strings/*/Resources.resw
Source language: en_us
Languages: zh_cn

# NavNodesLabel.Text
source: Nodes
zh_cn: 节点

# NavProcessesLabel.Text
source: Processes
zh_cn: 进程

# NavLogsLabel.Text
source: Logs
zh_cn: 日志

# NavSettingsLabel.Text
source: Settings
zh_cn: 设置

# NodesPageTitle.Text
source: Nodes
zh_cn: 节点

# NodesPageSubtitle.Text
source: Node Management
zh_cn: 节点管理

# NodesSearchBox.PlaceholderText
source: Search nodes
zh_cn: 搜索节点

# NodesPingBtn.Text
source: Speed Test
zh_cn: 测速

# NodesImportBtn.Text
source: Import
zh_cn: 导入

# NodesEditBtn.Text
source: Edit
zh_cn: 编辑

# NodesEmptyLine1.Text
source: No nodes yet
zh_cn: 暂无节点

# NodesEmptyLine2.Text
source: Click "Import" to add
zh_cn: 点击「导入」添加

# NodeCtxEdit.Text
source: Edit
zh_cn: 编辑

# NodeCtxDelete.Text
source: Delete
zh_cn: 删除

# NodeCtxCopyAddr.Text
source: Copy Address
zh_cn: 复制地址

# NodeCtxCopyLink.Text
source: Copy Link
zh_cn: 复制链接

# TrafficTitle.Text
source: Real-time Traffic
zh_cn: 实时流量

# TrafficEmptyHint.Text
source: No Data
zh_cn: 暂无数据

# ProcessesTitle.Text
source: Process Routing
zh_cn: 进程路由

# ProcessesSubtitle.Text
source: Choose proxy path per process
zh_cn: 按进程选择代理路径

# ProcessesRefreshBtn.Text
source: Refresh
zh_cn: 刷新

# ProcessesEmptyHint.Text
source: No routable processes found
zh_cn: 未发现可路由的进程

# ProcessCtxProxy.Text
source: Use Proxy
zh_cn: 走代理

# ProcessCtxDirect.Text
source: Direct
zh_cn: 直连

# ProcessCtxBlock.Text
source: Block
zh_cn: 阻止

# ProcSegmentProxy.Content
source: Proxy
zh_cn: 代理

# ProcSegmentDirect.Content
source: Direct
zh_cn: 直连

# ProcSegmentBlock.Content
source: Block
zh_cn: 阻止

# AppLogTitle.Text
source: App Log
zh_cn: 应用日志

# AppLogCopyBtn.Text
source: Copy
zh_cn: 复制

# AppLogRefreshBtn.Text
source: Refresh
zh_cn: 刷新

# EngineLogTitle.Text
source: Engine Log
zh_cn: 引擎日志

# EngineLogCopyBtn.Text
source: Copy
zh_cn: 复制

# EngineLogRefreshBtn.Text
source: Refresh
zh_cn: 刷新

# SettingsTitle.Text
source: Settings
zh_cn: 设置

# SettingsSubtitle.Text
source: Routing, appearance & update preferences
zh_cn: 路由、外观与更新偏好

# SettingsProxyLabel.Text
source: Proxy
zh_cn: 代理

# SettingsRoutingMode.Text
source: Routing Mode
zh_cn: 路由模式

# SettingsModeGlobal.Content
source: Global
zh_cn: 全局

# SettingsModeRule.Content
source: Rule
zh_cn: 规则

# SettingsModeDirectOnly.Content
source: Direct Only
zh_cn: 仅直连

# SettingsModeProcessOnly.Content
source: Process Only
zh_cn: 仅进程

# SettingsLocalPort.Text
source: Local Port
zh_cn: 本地端口

# SettingsAutoConnect.Header
source: Auto-connect on startup
zh_cn: 启动时自动连接

# SettingsAutoConnect.OnContent
source: On
zh_cn: 开

# SettingsAutoConnect.OffContent
source: Off
zh_cn: 关

# SettingsTun.Header
source: Enable TUN Mode
zh_cn: 启用 TUN 模式

# SettingsTun.OnContent
source: On
zh_cn: 开

# SettingsTun.OffContent
source: Off
zh_cn: 关

# SettingsAppearanceLabel.Text
source: Appearance & Updates
zh_cn: 外观与更新

# SettingsTheme.Text
source: Theme
zh_cn: 主题

# SettingsThemeSystem.Content
source: System
zh_cn: 跟随系统

# SettingsThemeDark.Content
source: Dark
zh_cn: 深色

# SettingsThemeLight.Content
source: Light
zh_cn: 浅色

# SettingsSubAutoUpdate.Text
source: Subscription Auto-update (min)
zh_cn: 订阅自动更新（分钟）

# SettingsAutoPing.Text
source: Auto Ping (min)
zh_cn: 自动测速（分钟）

# SettingsSubscriptionsLabel.Text
source: Subscriptions
zh_cn: 订阅源

# SubsEmptyLine1.Text
source: No subscriptions
zh_cn: 暂无订阅源

# SubsEmptyLine2.Text
source: Add via "Import"
zh_cn: 通过「导入」添加订阅地址

# SettingsBackupBtn.Text
source: Backup Config
zh_cn: 备份配置

# SettingsRestoreBtn.Text
source: Restore Config
zh_cn: 恢复配置

# SettingsSaveBtn.Content
source: Save Settings
zh_cn: 保存设置

# FooterCopyright.Text
source: © 2026 Akiro · For learning and communication only
zh_cn: © 2026 Akiro · 仅供学习与交流使用

# FooterVersionTooltip.Text
source: Akiroute v0.1.1 Copyright © 2026 Akiro. All rights reserved. For learning and communication only. No commercial use, copying, or redistribution. Akiroute v0.1.1 — All rights reserved. For learning and communication only. No commercial use, copying, or redistribution.
zh_cn: Akiroute v0.1.1 Copyright © 2026 Akiro. 保留所有权利。 本软件仅供学习与交流使用，禁止商业用途、复制与再分发。 Akiroute v0.1.1 — All rights reserved. For learning and communication only. No commercial use, copying, or redistribution.

# StatusToggleBtn.Text
source: Start
zh_cn: 启动

# NodeCardUntested.Text
source: Untested
zh_cn: 未测

# NodeCardLatencyUntested
source: Untested
zh_cn: 未测

# EditNodeDlg.Title
source: Edit Node
zh_cn: 编辑节点

# EditNodeDlg.PrimaryButtonText
source: Save
zh_cn: 保存

# EditNodeDlg.CloseButtonText
source: Cancel
zh_cn: 取消

# EditNodeName.Header
source: Name
zh_cn: 名称

# EditNodeName.PlaceholderText
source: Node display name
zh_cn: 节点显示名称

# EditNodeType.Header
source: Type
zh_cn: 类型

# EditNodeType.PlaceholderText
source: Protocol type
zh_cn: 协议类型

# EditNodeAddr.Header
source: Address
zh_cn: 地址

# EditNodeAddr.PlaceholderText
source: Server hostname or IP
zh_cn: 服务器主机名或 IP

# EditNodePort.Header
source: Port
zh_cn: 端口

# EditNodeExtra.Header
source: Advanced Parameters (ExtraParams)
zh_cn: 高级参数 (ExtraParams)

# ImportDlg.Title
source: Import Nodes
zh_cn: 导入节点

# ImportDlg.PrimaryButtonText
source: Import
zh_cn: 导入

# ImportDlg.CloseButtonText
source: Cancel
zh_cn: 取消

# ImportLinkMode.Content
source: Paste Link
zh_cn: 粘贴链接

# ImportUrlMode.Content
source: Subscription URL
zh_cn: 订阅地址

# ImportPasteBox.PlaceholderText
source: Paste vless://, vmess://, ss://, trojan://, hysteria2://, tuic:// links, Base64 subscription body, or Clash config
zh_cn: 粘贴 vless://, vmess://, ss://, trojan://, hysteria2://, tuic:// 链接、Base64 订阅正文或 Clash 配置

# ImportUrlBox.PlaceholderText
source: https:// subscription URL
zh_cn: https:// 订阅地址

# Status.ToggleStart
source: Start
zh_cn: 启动

# Status.ToggleStop
source: Stop
zh_cn: 停止

# Status.StartFailed
source: Start Failed
zh_cn: 启动失败

# Status.NoNodeSelected
source: No node selected
zh_cn: 未选择节点

# Status.ConnectFailed
source: Connection Failed
zh_cn: 连接失败

# Status.Connecting
source: Connecting…
zh_cn: 正在连接…

# Status.ConnectedPort
source: Connected · Port {0}
zh_cn: 已连接 · 端口 {0}

# Status.Connected
source: Connected
zh_cn: 已连接

# Status.Disconnected
source: Not Connected
zh_cn: 未连接

# Error.SubUrlInvalid
source: Invalid subscription URL
zh_cn: 订阅地址无效

# Error.SubFetchFailed
source: Subscription fetch failed: {0}
zh_cn: 订阅获取失败: {0}

# Error.SubNoNodesParsed
source: No nodes parsed: subscription content is not a valid node link, Base64 subscription body, or Clash config
zh_cn: 未解析到任何节点：订阅内容不是有效的节点链接、Base64 订阅正文或 Clash 配置

# Error.SubNoNodesParsedShort
source: No nodes parsed
zh_cn: 未解析到任何节点

# Info.SubUpdated
source: Subscription updated: {0} added, {1} removed
zh_cn: 订阅已更新：新增 {0}，移除 {1}

# Info.ImportedNodes
source: {0} nodes imported
zh_cn: 已导入 {0} 个节点

# Error.PleaseSelectNode
source: Please select a node first
zh_cn: 请先选择一个节点

# Dialog.BackupSuccess
source: Backup Saved
zh_cn: 备份已保存

# Dialog.BackupSuccessDetail
source: Config exported to: {0}
zh_cn: 配置已导出到：{0}

# Dialog.BackupFail
source: Backup Failed
zh_cn: 备份失败

# Dialog.RestoreFail
source: Restore Failed
zh_cn: 恢复失败

# Dialog.RestoreFailInvalid
source: Config file is invalid or unreadable
zh_cn: 配置文件无效或无法读取

# Dialog.RestoreSuccess
source: Restore Successful
zh_cn: 恢复成功

# Dialog.RestoreSuccessDetail
source: Restore successful, restart to apply
zh_cn: 恢复成功，重启应用后生效

# Dialog.RestoreFailDetail
source: Failed to write config: {0}
zh_cn: 写入配置失败：{0}

# Dialog.Ok
source: OK
zh_cn: 确定

# EditNodeValidation.NameEmpty
source: Name cannot be empty
zh_cn: 名称不能为空

# EditNodeValidation.AddressEmpty
source: Address cannot be empty
zh_cn: 地址不能为空

# EditNodeValidation.PortInvalid
source: Port must be an integer between 1 and 65535
zh_cn: 端口必须是 1 - 65535 之间的整数

# EditNodeValidation.ExtraInvalid
source: Advanced parameters must be a valid JSON object
zh_cn: 高级参数必须是有效的 JSON 对象

# Logs.EmptyPlaceholder
source: (No logs)
zh_cn: （暂无日志）

# Error.SaveFailed
source: Save failed: {0}
zh_cn: 保存失败: {0}

# Tray.StopProxy
source: Stop Proxy
zh_cn: 停止代理

# Tray.StartProxy
source: Start Proxy
zh_cn: 启动代理

# Tray.SwitchNode
source: Switch Node · {0}
zh_cn: 切换节点 · {0}

# Tray.ShowWindow
source: Show Window
zh_cn: 显示主窗口

# Tray.Exit
source: Exit
zh_cn: 退出
